package com.baobaotao.beta;

import java.util.Map;
import java.util.concurrent.ConcurrentHashMap;

/**
 * 
 * 下一个--基础节假日 （离当天最近的节日，比如元旦，应该当天和明年元旦做比较）
 * 时间格式
 * 今天/昨天/后天	是时刻	20181027-000000
 *	上周一	是时刻	20181015-000000
 *	下周一	是时刻	20181029-000000
 *	中秋节	是时刻	20180924-000000
 *	国庆节	是时刻	20181001-000000
 *	昨天上午	时间间隔	
 *
 *  输出的时间格式	YYYYMMDD-HHmmss
 *
 *
 *4月26号之前的，都要取19年， 5月1日之后，取18年的
 *
 */

public class BaseHolidayNext {
	
	private static Map<String, String> map = new ConcurrentHashMap<String, String>(5000);
	
	
	public static Map<String, String> getIntance() {
		return map;
	}
	
	static {
		try {
			init();
		} catch(Exception e) {
			
		}
		
	}

	private static void init() {
		
		firstSeason();
		
		secondSeason();
		
		thirdSeason();
		
		forthSeason();
	}
	
	/**
	 * 第一季度 1月到3月
	 */
	private static void firstSeason() {
		map.put("元旦", "20190101-000000");
		map.put("元旦节", "20190101-000000");
		map.put("腊八节", "20190113-000000");
		map.put("腊八", "20190113-000000");
		map.put("国际麻风节", "20190127-000000");
		map.put("麻风节", "20190127-000000");
		map.put("小年", "20190128-000000");
		map.put("传统扫房日", "20190129-000000");
		map.put("扫房日", "20190129-000000");
		map.put("世界湿地日", "20190202-000000");
		map.put("湿地日", "20190202-000000");
		map.put("除夕", "20190204-000000");
		map.put("大年三十", "20190204-000000");
		map.put("三十", "20190204-000000");
		map.put("农历春节", "20190205-000000");
		map.put("大年初一", "20190205-000000");
		map.put("春节", "20190205-000000");
		map.put("情人节", "20190214-000000");
		map.put("元宵节", "20190219-000000");
		map.put("元宵", "20190219-000000");
		map.put("正月十五", "20190219-000000");
		map.put("全国爱耳日", "20190303-000000");
		map.put("爱耳日", "20190303-000000");
		map.put("青年志愿者服务日", "20190305-000000");
		map.put("志愿者服务日", "20190305-000000");
		map.put("国际妇女节", "20190308-000000");
		map.put("妇女节", "20190308-000000");
		map.put("龙抬头", "20190308-000000");
		map.put("二月初二", "20190308-000000");
		map.put("二月二", "20190308-000000");
		map.put("中和节", "20190308-000000");
		map.put("保护母亲河日", "20190309-000000");
		map.put("母亲河日", "20190309-000000");
		map.put("中国植树节", "20190312-000000");
		map.put("植树节", "20190312-000000");
		map.put("白色情人节", "20190314-000000");
		map.put("国际警察日", "20190314-000000");
		map.put("警察日", "20190314-000000");
		map.put("世界消费者权益日", "20190315-000000");
		map.put("国际消费者权益日", "20190315-000000");
		map.put("消费者权益日", "20190315-000000");
		map.put("世界森林日", "20190321-000000");
		map.put("森林日", "20190321-000000");
		map.put("世界睡眠日", "20190321-000000");
		map.put("睡眠日", "20190321-000000");
		map.put("世界水日", "20190322-000000");
		map.put("水日", "20190322-000000");
		map.put("世界气象日", "20190323-000000");
		map.put("气象日", "20190323-000000");
		map.put("中小学生安全教育日", "20190325-000000");
		map.put("学生安全教育日", "20190325-000000");
		map.put("世界防治结核病日", "20190324-000000");
		map.put("防治结核病日", "20190324-000000");
	}
	
	/**
	 * 第二季度 4月到6月
	 */
    private static void secondSeason() {
    	map.put("愚人节", "20190401-000000");
    	map.put("清明节", "20190405-000000");
    	map.put("鬼节", "20190405-000000");
    	map.put("世界卫生日", "20190407-000000");
    	map.put("卫生日", "20190407-000000");
    	map.put("复活节", "20190421-000000");
    	map.put("世界地球日", "20190422-000000");
    	map.put("地球日", "20190422-000000");
    	map.put("世界知识产权日", "20190426-000000");
    	map.put("知识产权日", "20190426-000000");
    	map.put("国际劳动节", "20190501-000000");
    	map.put("劳动节", "20190501-000000");
    	map.put("世界哮喘日", "20190503-000000");
    	map.put("哮喘日", "20190503-000000");
    	map.put("中国青年节", "20190504-000000");
    	map.put("青年节", "20190504-000000");
    	map.put("世界红十字日", "20190508-000000");
    	map.put("红十字日", "20190508-000000");
    	map.put("国际护士节", "20190512-000000");
    	map.put("护士节", "20190512-000000");
    	map.put("母亲节", "20190512-000000");
    	map.put("妈妈节", "20190512-000000");
    	map.put("国际家庭日", "20190515-000000");
    	map.put("家庭日", "20190515-000000");
    	map.put("世界电信日", "20190517-000000");
    	map.put("电信日", "20190517-000000");
    	map.put("全国助残日", "20190525-000000");
    	map.put("助残日", "20190525-000000");
    	map.put("全国学生营养日", "20190520-000000");
    	map.put("学生营养日", "20190520-000000");
    	map.put("营养日", "20190520-000000");
    	map.put("国际牛奶日", "20190523-000000");
    	map.put("牛奶日", "20190523-000000");
    	map.put("世界无烟日", "20190531-000000");
    	map.put("无烟日", "20190531-000000");
    	map.put("国际儿童节", "20190601-000000");
    	map.put("儿童节", "20190601-000000");
    	map.put("世界环境日", "20190605-000000");
    	map.put("环境日", "20190605-000000");
    	map.put("全国爱眼日", "20190606-000000");
    	map.put("爱眼日", "20190606-000000");
    	map.put("父亲节", "20190616-000000");
    	map.put("端午节", "20190607-000000");
    	map.put("端午", "20190607-000000");
    	map.put("世界防治荒漠化和干旱日", "20190617-000000");
    	map.put("防治荒漠化和干旱日", "20190617-000000");
    	map.put("国际奥林匹克日", "20190623-000000");
    	map.put("奥林匹克日", "20190623-000000");
    	map.put("全国土地日", "20190625-000000");
    	map.put("土地日", "20190625-000000");
    	map.put("国际禁毒日", "20190626-000000");
    	map.put("禁毒日", "20190626-000000");
	}
    /**
	 * 第三季度 7月到9月
	 */
    private static void thirdSeason() {
    	map.put("中国共产党诞生日", "20190701-000000");
    	map.put("共产党诞生日", "20190701-000000");
    	map.put("共产党的生日", "20190701-000000");
    	map.put("共产党生日", "20190701-000000");
    	map.put("党的生日", "20190701-000000");
    	map.put("建党节", "20190701-000000");
    	map.put("国际建筑日", "20190701-000000");
    	map.put("建筑日", "20190701-000000");
    	map.put("中国人民抗日战争纪念日", "20190707-000000");
    	map.put("抗日战争纪念日", "20190707-000000");
    	map.put("抗战纪念日", "20190707-000000");
    	map.put("抗战纪念", "20190707-000000");
    	map.put("世界人口日", "20190711-000000");
    	map.put("人口日", "20190711-000000");
    	map.put("中国人民解放军建军节", "20190801-000000");
    	map.put("建军节", "20190801-000000");
    	map.put("火把节", "20190805-000000");
    	map.put("国际青年节", "20190812-000000");
    	map.put("中国情人节", "20190817-000000");
    	map.put("七夕节", "20190807-000000");
    	map.put("七夕", "20190807-000000");
    	map.put("中元节", "20190815-000000");
    	map.put("国际扫盲日", "20190908-000000");
    	map.put("扫盲日", "20190908-000000");
    	map.put("中国教师节", "20190910-000000");
    	map.put("教师节", "20190910-000000");
    	map.put("老师节", "20190910-000000");
    	map.put("全国国防教育日", "20190921-000000");
    	map.put("国防教育日", "20190921-000000");
    	map.put("中国脑健康日", "20190916-000000");
    	map.put("脑健康日", "20190916-000000");
    	map.put("国际臭氧层保护日", "20190916-000000");
    	map.put("臭氧层保护日", "20190916-000000");
    	map.put("国际和平日", "20190917-000000");
    	map.put("和平日", "20190917-000000");
    	map.put("全国爱牙日", "20190920-000000");
    	map.put("爱牙日", "20190920-000000");
    	map.put("世界停火日", "20190921-000000");
    	map.put("停火日", "20190921-000000");
    	map.put("中秋节", "20190913-000000");
    	map.put("月饼节", "20190913-000000");
    	map.put("八月十五", "20190924-000000");
    	map.put("世界旅游日", "20190927-000000");
    	map.put("旅游日", "20190927-000000");
    	map.put("国际聋人节", "20190922-000000");
    	map.put("聋人节", "20190922-000000");
	}
    
    /**
   	 * 第四季度10月到12月
   	 */
	private static void forthSeason() {
		map.put("中华人民共和国国庆节", "20191001-000000");
		map.put("中国国庆节", "20191001-000000");
		map.put("国庆节", "20191001-000000");
		map.put("国庆", "20191001-000000");
		map.put("世界住房日", "20191007-000000");
		map.put("住房日", "20191007-000000");
		map.put("国际音乐日", "20191001-000000");
		map.put("音乐日", "20191001-000000");
		map.put("音乐节", "20191001-000000");
		map.put("国际老年人日", "20191001-000000");
		map.put("老年人日", "20191001-000000");
		map.put("老人日", "20191001-000000");
		map.put("世界动物日", "20191004-000000");
		map.put("动物日", "20191004-000000");
		map.put("世界教师日", "20191005-000000");
		map.put("教师日", "20191005-000000");
		map.put("加拿大感恩节", "20191014-000000");
		map.put("全国高血压日", "20191014-000000");
		map.put("高血压日", "20191008-000000");
		map.put("世界邮政日", "20191009-000000");
		map.put("邮政日", "20191009-000000");
		map.put("国际减轻自然灾害日", "20191009-000000");
		map.put("减轻自然灾害日", "20191009-000000");
		map.put("自然灾害日", "20191009-000000");
		map.put("世界精神卫生日", "20191010-000000");
		map.put("精神卫生日", "20191010-000000");
		map.put("世界爱眼日", "20191010-000000");
		map.put("世界标准日", "20191014-000000");
		map.put("国际盲人节", "20191015-000000");
		map.put("盲人节", "20191015-000000");
		map.put("世界农村妇女日", "20191015-000000");
		map.put("农村妇女日", "20191015-000000");
		map.put("世界粮食日", "20191016-000000");
		map.put("粮食日", "20191016-000000");
		map.put("重阳节", "20191007-000000");
		map.put("国际消除贫困日", "20191017-000000");
		map.put("消除贫困日", "20191017-000000");
		map.put("联合国日", "20191024-000000");
		map.put("世界发展新闻日", "20191024-000000");
		map.put("发展新闻日", "20191024-000000");
		map.put("程序员节", "20191024-000000");
		map.put("程序员日", "20191024-000000");
		map.put("中国男性健康日", "20191028-000000");
		map.put("男性健康日", "20191028-000000");
		map.put("国际生物多样性日", "20181029-000000");
		map.put("生物多样性日", "20181029-000000");
		map.put("生物多样日", "20181029-000000");
		map.put("万圣节", "20181031-000000");
		map.put("中国记者节", "20181108-000000");
		map.put("记者节", "20181108-000000");
		map.put("记者日", "20181108-000000");
		map.put("中国记者日", "20181108-000000");
		map.put("消防宣传日", "20181109-000000");
		map.put("光棍节", "20181111-000000");
		map.put("世界糖尿病日", "20181114-000000");
		map.put("糖尿病日", "20181114-000000");
		map.put("国际大学生节", "20181117-000000");
		map.put("大学生节", "20181117-000000");
		map.put("国际消除对妇女的暴力日", "20181125-000000");
		map.put("消除对妇女的暴力日", "20181125-000000");
		map.put("美国感恩节", "20181122-000000");
		map.put("感恩节", "20181122-000000");
		map.put("世界爱滋病日", "20181201-000000");
		map.put("爱滋病日", "20181201-000000");
		map.put("世界残疾人日", "20181203-000000");
		map.put("残疾人日", "20181203-000000");
		map.put("全国法制宣传日", "20181204-000000");
		map.put("法制宣传日", "20181204-000000");
		map.put("世界足球日", "20181209-000000");
		map.put("足球日", "20181209-000000");
		map.put("平安夜", "20181224-000000");
		map.put("圣诞节", "20181225-000000");
		map.put("圣诞", "20181225-000000");
		map.put("国际生物多样性日", "20181229-000000");
		map.put("生物多样性日", "20181229-000000");
	}
}
